УчетВУправляющихДляГит1/src/Enums/ВидСчетаФактурыВыставленного/ВидСчетаФактурыВыставленного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчетаФактурыВыставленного</name>
  <comment>Вид выставленного счета-фактуры</comment>
  <enumValues>
    <name>НаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>НаАванс</name>
  </enumValues>
  <enumValues>
    <name>НаСуммовуюРазницу</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>Корректировочный</name>
  </enumValues>
  <enumValues>
    <name>НаАвансКомитента</name>
  </enumValues>
  <enumValues>
    <name>НаАвансКомитентаНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>СводнаяСправка</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйНаАванс</name>
  </enumValues>
  <enumValues>
    <name>КорректировочнаяСправка</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидСчетаФактурыВыставленного/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив значений перечисления, соответствующих авансовому счету-фактуре.
// Возвращаемое значение
//    ВидыСчетовФактурНаАванс - Массив.
Функция СчетаФактурыНаАванс() Экспорт
	
	ВидыСчетовФактурНаАванс = Новый Массив();
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАванс);
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку);
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс);
	
	Возврат ВидыСчетовФактурНаАванс;
	
КонецФункции

#КонецОбласти

#КонецЕсли
